; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v3 - type_2 ?v7 - type_3)
 	      (pred_3 ?v5 - object ?v7 - type_3)
	      (pred_1 ?v3 - type_2 ?v8 - type_1)
	      (pred_2 ?v3 - type_2 ?v5 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v3 - type_2 ?v1 ?v2 - type_3)
       :precondition (and  (pred_4 ?v3 ?v1))
       :effect (and  (pred_4 ?v3 ?v2)
		     (not (pred_4 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_2 ?v4 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v6) (pred_4 ?v3 ?v6) (pred_1 ?v3 ?v8))
       :effect (and (pred_2 ?v3 ?v4 ?v8)
		    (not (pred_3 ?v4 ?v6)) 
		    (not (pred_1 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_2 ?v4 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v4 ?v8) (pred_4 ?v3 ?v6))
       :effect (and (pred_3 ?v4 ?v6)
		    (pred_1 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v4 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_01 - type_2
obj_14 obj_02 obj_04 obj_07 - type_1
obj_08 obj_03 obj_06 obj_13 - type_3
obj_12 obj_05 obj_11 obj_10 - object)
(:init
(pred_4 obj_09 obj_08)
(pred_1 obj_09 obj_14)
(pred_1 obj_09 obj_02)
(pred_4 obj_01 obj_03)
(pred_1 obj_01 obj_04)
(pred_1 obj_01 obj_07)
(pred_3 obj_12 obj_06)
(pred_3 obj_05 obj_06)
(pred_3 obj_11 obj_03)
(pred_3 obj_10 obj_06)
)
(:goal
(and
(pred_3 obj_12 obj_13)
(pred_3 obj_05 obj_08)
(pred_3 obj_11 obj_06)
(pred_3 obj_10 obj_03)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_06)))
)
)

; plan
1. (op_3 obj_09 obj_08 obj_03)
   deleted: (pred_4 obj_09 obj_08)
   added: (pred_4 obj_09 obj_03)
   goals met: 0 of 4
2. (op_1 obj_01 obj_11 obj_03 obj_07)
   deleted: (pred_3 obj_11 obj_03) (pred_1 obj_01 obj_07)
   added: (pred_2 obj_01 obj_11 obj_07)
   goals met: 0 of 4
3. (op_3 obj_01 obj_03 obj_06)
   deleted: (pred_4 obj_01 obj_03)
   added: (pred_4 obj_01 obj_06)
   goals met: 0 of 4
4. (op_2 obj_01 obj_11 obj_06 obj_07)
   deleted: (pred_2 obj_01 obj_11 obj_07)
   added: (pred_3 obj_11 obj_06) (pred_1 obj_01 obj_07)
   goals met: 1 of 4
5. (op_1 obj_01 obj_05 obj_06 obj_04)
   deleted: (pred_3 obj_05 obj_06) (pred_1 obj_01 obj_04)
   added: (pred_2 obj_01 obj_05 obj_04)
   goals met: 1 of 4
6. (op_3 obj_01 obj_06 obj_08)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_08)
   goals met: 1 of 4
7. (op_2 obj_01 obj_05 obj_08 obj_04)
   deleted: (pred_2 obj_01 obj_05 obj_04)
   added: (pred_3 obj_05 obj_08) (pred_1 obj_01 obj_04)
   goals met: 2 of 4
8. (op_3 obj_01 obj_08 obj_06)
   deleted: (pred_4 obj_01 obj_08)
   added: (pred_4 obj_01 obj_06)
   goals met: 2 of 4
9. (op_1 obj_01 obj_12 obj_06 obj_07)
   deleted: (pred_3 obj_12 obj_06) (pred_1 obj_01 obj_07)
   added: (pred_2 obj_01 obj_12 obj_07)
   goals met: 2 of 4
10. (op_3 obj_01 obj_06 obj_13)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_13)
   goals met: 2 of 4
11. (op_2 obj_01 obj_12 obj_13 obj_07)
   deleted: (pred_2 obj_01 obj_12 obj_07)
   added: (pred_3 obj_12 obj_13) (pred_1 obj_01 obj_07)
   goals met: 3 of 4
12. (op_3 obj_01 obj_13 obj_06)
   deleted: (pred_4 obj_01 obj_13)
   added: (pred_4 obj_01 obj_06)
   goals met: 3 of 4
13. (op_1 obj_01 obj_10 obj_06 obj_07)
   deleted: (pred_3 obj_10 obj_06) (pred_1 obj_01 obj_07)
   added: (pred_2 obj_01 obj_10 obj_07)
   goals met: 3 of 4
14. (op_3 obj_01 obj_06 obj_03)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_03)
   goals met: 3 of 4
15. (op_2 obj_01 obj_10 obj_03 obj_07)
   deleted: (pred_2 obj_01 obj_10 obj_07)
   added: (pred_3 obj_10 obj_03) (pred_1 obj_01 obj_07)
   goals met: 4 of 4
